Embedfire-stm32f103-badao/ebf_stm32f103_badao_hal_code/ov7725/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2013-xx-xx
  * @brief   液晶显示
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火 F103-霸道 STM32 开发板 
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :https://fire-stm32.taobao.com
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx.h"
#include "./usart/bsp_debug_usart.h"
#include <stdlib.h>
#include "./led/bsp_led.h" 
#include "./lcd/bsp_ili9341_lcd.h"
#include "./ov7725/bsp_ov7725.h"




//static void LCD_Test(void);	
//static void Delay ( __IO uint32_t nCount );
void Printf_Charater(void);

/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void)
{
	uint8_t retry = 0;
  /* 系统时钟初始化成72MHz */
  SystemClock_Config();
  /* LED 端口初始化 */
  LED_GPIO_Config();	 
  /* 初始化串口 */
  DEBUG_USART_Config();

  ILI9341_Init ();             //LCD 初始化
	
	printf("\r\n ********** 液晶屏英文显示程序*********** \r\n"); 
	printf("\r\n 本程序不支持中文，显示中文的程序请学习下一章 \r\n"); 

	//其中0、3、5、6 模式适合从左至右显示文字，
 //不推荐使用其它模式显示文字	其它模式显示文字会有镜像效果			
 //其中 6 模式为大部分液晶例程的默认显示方向  
  ILI9341_GramScan( 3 );
	LCD_SetFont(&Font8x16);
	LCD_SetColors(RED,BLACK);

  ILI9341_Clear(0,0,LCD_X_LENGTH,LCD_Y_LENGTH);	/* 清屏，显示全黑 */
	
	/********显示字符串示例*******/
  ILI9341_DispStringLine_EN(LINE(0),"BH OV7725 Test Demo");

	//Key_GPIO_Config();
	//SysTick_Init();
	printf("\r\n ** OV7725摄像头实时液晶显示例程** \r\n"); 
	
	/* ov7725 gpio 初始化 */
	OV7725_GPIO_Config();
	
	LED_BLUE;
	/* ov7725 寄存器默认配置初始化 */
	while(OV7725_Init() != SUCCESS)
	{
		retry++;
		if(retry>5)
		{
			printf("\r\n没有检测到OV7725摄像头\r\n");
			ILI9341_DispStringLine_EN(LINE(2),"No OV7725 module detected!");
			while(1);
		}
	}
}

///*用于测试各种液晶的函数*/
//void LCD_Test(void)
//{
//	/*演示显示变量*/
//	static uint8_t testCNT = 0;	
//	char dispBuff[100];
//	
//	testCNT++;	
//	
//	LCD_SetFont(&Font8x16);
//	LCD_SetColors(RED,BLACK);

//  ILI9341_Clear(0,0,LCD_X_LENGTH,LCD_Y_LENGTH);	/* 清屏，显示全黑 */
//	/********显示字符串示例*******/
//  ILI9341_DispStringLine_EN(LINE(0),"BH 3.2 inch LCD para:");
//  ILI9341_DispStringLine_EN(LINE(1),"Image resolution:240x320 px");
//  ILI9341_DispStringLine_EN(LINE(2),"ILI9341 LCD driver");
//  ILI9341_DispStringLine_EN(LINE(3),"XPT2046 Touch Pad driver");
//  
//	/********显示变量示例*******/
//	LCD_SetFont(&Font16x24);
//	LCD_SetTextColor(GREEN);

//	/*使用c标准库把变量转化成字符串*/
//	sprintf(dispBuff,"Count : %d ",testCNT);
//  LCD_ClearLine(LINE(4));	/* 清除单行文字 */
//	
//	/*然后显示该字符串即可，其它变量也是这样处理*/
//	ILI9341_DispStringLine_EN(LINE(4),dispBuff);

//	/*******显示图形示例******/
//	LCD_SetFont(&Font24x32);
//  /* 画直线 */
//  
//  LCD_ClearLine(LINE(4));/* 清除单行文字 */
//	LCD_SetTextColor(BLUE);

//  ILI9341_DispStringLine_EN(LINE(4),"Draw line:");
//  
//	LCD_SetTextColor(RED);
//  ILI9341_DrawLine(50,170,210,230);  
//  ILI9341_DrawLine(50,200,210,240);
//  
//	LCD_SetTextColor(GREEN);
//  ILI9341_DrawLine(100,170,200,230);  
//  ILI9341_DrawLine(200,200,220,240);
//	
//	LCD_SetTextColor(BLUE);
//  ILI9341_DrawLine(110,170,110,230);  
//  ILI9341_DrawLine(130,200,220,240);
//  
//  Delay(0xFFFFFF);
//  
//  ILI9341_Clear(0,16*8,LCD_X_LENGTH,LCD_Y_LENGTH-16*8);	/* 清屏，显示全黑 */
//  
//  
//  /*画矩形*/

//  LCD_ClearLine(LINE(4));	/* 清除单行文字 */
//	LCD_SetTextColor(BLUE);

//  ILI9341_DispStringLine_EN(LINE(4),"Draw Rect:");

//	LCD_SetTextColor(RED);
//  ILI9341_DrawRectangle(50,200,100,30,1);
//	
//	LCD_SetTextColor(GREEN);
//  ILI9341_DrawRectangle(160,200,20,40,0);
//	
//	LCD_SetTextColor(BLUE);
//  ILI9341_DrawRectangle(170,200,50,20,1);
//  
//  
//  Delay(0xFFFFFF);
//	
//	ILI9341_Clear(0,16*8,LCD_X_LENGTH,LCD_Y_LENGTH-16*8);	/* 清屏，显示全黑 */

//  /* 画圆 */
//  LCD_ClearLine(LINE(4));	/* 清除单行文字 */
//	LCD_SetTextColor(BLUE);
//	
//  ILI9341_DispStringLine_EN(LINE(4),"Draw Cir:");

//	LCD_SetTextColor(RED);
//  ILI9341_DrawCircle(100,200,20,0);
//	
//	LCD_SetTextColor(GREEN);
//  ILI9341_DrawCircle(100,200,10,1);
//	
//	LCD_SetTextColor(BLUE);
//	ILI9341_DrawCircle(140,200,20,0);

//  Delay(0xFFFFFF);
//  
//  ILI9341_Clear(0,16*8,LCD_X_LENGTH,LCD_Y_LENGTH-16*8);	/* 清屏，显示全黑 */
//}


/**
  * @brief  简单延时函数
  * @param  nCount ：延时计数值
  * @retval 无
  */	
//static void Delay ( __IO uint32_t nCount )
//{
//  for ( ; nCount != 0; nCount -- );
//	
//}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 72000000
  *            HCLK(Hz)                       = 72000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 2
  *            APB2 Prescaler                 = 1
  *            HSE Frequency(Hz)              = 8000000
  *            HSE PREDIV1                    = 2
  *            PLLMUL                         = 9
  *            Flash Latency(WS)              = 0
  * @param  None
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef clkinitstruct = {0};
  RCC_OscInitTypeDef oscinitstruct = {0};
  
  /* Enable HSE Oscillator and activate PLL with HSE as source */
  oscinitstruct.OscillatorType  = RCC_OSCILLATORTYPE_HSE;
  oscinitstruct.HSEState        = RCC_HSE_ON;
  oscinitstruct.HSEPredivValue  = RCC_HSE_PREDIV_DIV1;
  oscinitstruct.PLL.PLLState    = RCC_PLL_ON;
  oscinitstruct.PLL.PLLSource   = RCC_PLLSOURCE_HSE;
  oscinitstruct.PLL.PLLMUL      = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&oscinitstruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  clkinitstruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  clkinitstruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  clkinitstruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  clkinitstruct.APB2CLKDivider = RCC_HCLK_DIV1;
  clkinitstruct.APB1CLKDivider = RCC_HCLK_DIV2;  
  if (HAL_RCC_ClockConfig(&clkinitstruct, FLASH_LATENCY_2)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
